003_flowAroundCylinder/buoyantSimpleFoam/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15; // 20 degC

boundaryField
{
    Xmin
    {
        type            fixedValue;
        value           $internalField;
    }

    Xmax
    {
        type            zeroGradient;
    }

    "(Ymin|Ymax)"
    {
        type            slip;
    }

    hole
    {
        type            fixedValue;
        value           uniform 323.15; // 50 degC
    }

    empty
    {
        type            empty;
    }
}



// ************************************************************************* //
