003_flowAroundCylinder/buoyantSimpleFoam/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    Xmin
    {
        type            calculated;
        value           $internalField;
    }

    Xmax
    {
        type            calculated;
        value           $internalField;
    }

    "(Ymin|Ymax)"
    {
        type            calculated;
        value           $internalField;
    }

    hole
    {
        type            calculated;
        value           $internalField;
    }

    empty
    {
        type            empty;
    }
}

// ************************************************************************* //
