003_flowAroundCylinder/buoyantSimpleFoam/system/continuityErrorVolDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object continuityErrorVolDict;
}

continuityError1
{
  type continuityError;
  libs
    (
      fieldFunctionObjects
    ); 	// Mandatory entries (unmodifiable)// Optional entries (runtime modifiable)
  phi phi; 	// Optional (inherited) entries
  writePrecision 8;
  writeToFile yes;
  useUserTime yes;
  region region0;
  enabled yes;
  log yes;
  timeStart 0;
  timeEnd 6000;
  executeControl timeStep;
  executeInterval 1;
  writeControl timeStep;
  writeInterval 50;
}

Xmin
{
  type surfaceFieldValue;
  libs
    (
      "libfieldFunctionObjects.so"
    ); 	// residuals

  writeControl timeStep;
  log yes;
  writeFields no;
  regionType patch;
  name Xmin;
  operation sum;
  fields
    (
      phi
    ); 	// Optional (inherited) entries
  writePrecision 8;
  writeToFile yes;
  useUserTime yes;
  region region0;
  enabled yes;
  timeStart 0;
  timeEnd 8000;
  executeControl timeStep;
  executeInterval 1;
  writeInterval 100;
}

Xmax
{
  $Xmin;
  name Xmax;
}
