003_flowAroundCylinder/buoyantSimpleFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// solvers
// {
//     p_rgh
//     {
//         solver           GAMG;
//         tolerance        1e-7;
//         relTol           0.01;
//         smoother         DICGaussSeidel;
//     }

//     "(U|h|k|epsilon|omega)"
//     {
//         solver          PBiCGStab;
//         preconditioner  DILU;
//         tolerance       1e-8;
//         relTol          0.1;
//     }
// }

// SIMPLE
// {
//     momentumPredictor no;
//     nNonOrthogonalCorrectors 0;
//     pRefCell        0;
//     pRefValue       0;

//     residualControl
//     {
//         p_rgh           1e-4;
//         U               1e-4;
//         h               1e-4;

//         // possibly check turbulence fields
//         "(k|epsilon|omega)" 1e-3;
//     }
// }

// relaxationFactors
// {
//     fields
//     {
//         rho             1.0;
//         p_rgh           0.7;
//     }
//     equations
//     {
//         U               0.3;
//         h               0.3;
//         "(k|epsilon|omega)" 0.7;
//     }
// }
solvers
{
	U
	{
		solver    smoothSolver;
		tolerance    1e-6;
		minIter    1;
		relTol    0.1;
		smoother    symGaussSeidel;
		preconditioner    DILU;
	}

	p_rgh
	{
		solver    GAMG;
		tolerance    1e-6;
		relTol    0.01;
		minIter    1;
		smoother    DICGaussSeidel;
		nPreSweeps    0;
		nPostSweeps    2;
		cacheAgglomeration    on;
		agglomerator    faceAreaPair;
		nCellsInCoarsestLevel    200;
		mergeLevels    1;
		nFinestSweeps    2;
		nVcycles    2;
        solver           GAMG;
	}

	"k|omega|epsilon|nuTilda"
	{
		solver    smoothSolver;
		tolerance    1e-6;
		minIter    1;
		relTol    0.1;
		smoother    symGaussSeidel;
		preconditioner    DILU;
	}

	h
	{
		solver    smoothSolver;
		tolerance    1e-6;
		minIter    1;
		relTol    0.1;
		smoother    symGaussSeidel;
		preconditioner    DILU;
	}

	Ii
	{
		solver    PBiCG;
		preconditioner    DILU;
		tolerance    1e-4;
		relTol    0;
		minIter    1;
	}

}

SIMPLE
{
	momentumPredictor    on;
	consistent    off;
	nNonOrthogonalCorrectors    0;
	pRefCell    0;
	pRefValue    0;
	residualControl
	{
		p_rgh    1e-5;
		U    1e-6;
		h    1e-5;
		"k|epsilon|omega|nuTilda"    1e-6;
	}

}

relaxationFactors
{
	fields
	{
		rho    1.0;
		p_rgh    0.1;
	}

	equations
	{
		U    0.7;
		h    0.7;
		"k|epsilon|omega|nuTilda"    0.7;
	}

}

cache
{
	     grad(U);
}


// ************************************************************************* //
