003_flowAroundCylinder/buoyantSimpleFoam/system/heatWall
wallHeatFlux
{
    type    wallHeatFlux;
    libs    ("libfieldFunctionObjects.so");
    region    region0;
    writeControl    outputTime;
    patches    ();
}

heatTransferCoeff
{
    type    heatTransferCoeff;
    libs    ("libfieldFunctionObjects.so");
    region    region0;
    writeControl    outputTime;
    field    T;
    patches    ( walls );
    htcModel    fixedReferenceTemperature;
    TRef    330;
}